using System.Collections;
using System.Collections.Generic;
public static class WeatherCityID
{
	public static List<string> area = new List<string> () { "道北", "道東", "道南", "道央", "道南", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県", "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県" };
	public static List<List<string>> citys = new List<List<string>> ()
	{
		new List<string> { "稚内", "旭川", "留萌" },
			new List<string> { "網走", "北見", "紋別", "根室", "釧路", "帯広" },
			new List<string> { "室蘭", "浦河" },
			new List<string> { "札幌", "岩見沢", "倶知安" },
			new List<string> { "函館", "江差" },
			new List<string> { "青森", "むつ", "八戸" },
			new List<string> { "盛岡", "宮古", "大船渡" },
			new List<string> { "仙台", "白石" },
			new List<string> { "秋田", "横手" },
			new List<string> { "山形", "米沢", "酒田", "新庄" },
			new List<string> { "福島", "小名浜", "若松" },
			new List<string> { "水戸", "土浦" },
			new List<string> { "宇都宮", "大田原" },
			new List<string> { "前橋", "みなかみ" },
			new List<string> { "さいたま", "熊谷", "秩父" },
			new List<string> { "千葉", "銚子", "館山" },
			new List<string> { "東京", "大島", "八丈島", "父島" },
			new List<string> { "横浜", "小田原" },
			new List<string> { "新潟", "長岡", "高田", "相川" },
			new List<string> { "富山", "伏木" },
			new List<string> { "金沢", "輪島" },
			new List<string> { "福井", "敦賀" },
			new List<string> { "甲府", "河口湖" },
			new List<string> { "長野", "松本", "飯田" },
			new List<string> { "岐阜", "高山" },
			new List<string> { "静岡", "網代", "三島", "浜松" },
			new List<string> { "名古屋", "豊橋" },
			new List<string> { "津", "尾鷲" },
			new List<string> { "大津", "彦根" },
			new List<string> { "京都", "舞鶴" },
			new List<string> { "大阪" },
			new List<string> { "神戸", "豊岡" },
			new List<string> { "奈良", "風屋" },
			new List<string> { "和歌山", "潮岬" },
			new List<string> { "鳥取", "米子" },
			new List<string> { "松江", "浜田", "西郷" },
			new List<string> { "岡山", "津山" },
			new List<string> { "広島", "庄原" },
			new List<string> { "下関", "山口", "柳井", "萩" },
			new List<string> { "徳島", "日和佐" },
			new List<string> { "高松" },
			new List<string> { "松山", "新居浜", "宇和島" },
			new List<string> { "高知", "室戸岬", "清水" },
			new List<string> { "福岡", "八幡", "飯塚", "久留米" },
			new List<string> { "佐賀", "伊万里" },
			new List<string> { "長崎", "佐世保", "厳原", "福江" },
			new List<string> { "熊本", "阿蘇乙姫", "牛深", "人吉" },
			new List<string> { "大分", "中津", "日田", "佐伯" },
			new List<string> { "宮崎", "延岡", "都城", "高千穂" },
			new List<string> { "鹿児島", "鹿屋", "種子島", "名瀬" },
			new List<string> { "那覇", "名護", "久米島", "南大東", "宮古島", "石垣島", "与那国島" }
	};
	public static Dictionary<string, int> cityID = new Dictionary<string, int> ()
	{ { "稚内", 011000 }, { "旭川", 012010 }, { "留萌", 012020 },

		{ "網走", 013010 }, { "北見", 013020 }, { "紋別", 013030 }, { "根室", 014010 }, { "釧路", 014020 }, { "帯広", 014030 },

		{ "室蘭", 015010 }, { "浦河", 015020 },

		{ "札幌", 016010 }, { "岩見沢", 016020 }, { "倶知安", 016030 },

		{ "函館", 017010 }, { "江差", 017020 },

		{ "青森", 020010 }, { "むつ", 020020 }, { "八戸", 020030 },

		{ "盛岡", 030010 }, { "宮古", 030020 }, { "大船渡", 030030 },

		{ "仙台", 040010 }, { "白石", 040020 },

		{ "秋田", 050010 }, { "横手", 050020 },

		{ "山形", 060010 }, { "米沢", 060020 }, { "酒田", 060030 }, { "新庄", 060040 },

		{ "福島", 070010 }, { "小名浜", 070020 }, { "若松", 070030 },

		{ "水戸", 080010 }, { "土浦", 080020 },

		{ "宇都宮", 090010 }, { "大田原", 090020 },

		{ "前橋", 100010 }, { "みなかみ", 100020 },

		{ "さいたま", 110010 }, { "熊谷", 110020 }, { "秩父", 110030 },

		{ "千葉", 120010 }, { "銚子", 120020 }, { "館山", 120030 },

		{ "東京", 130010 }, { "大島", 130020 }, { "八丈島", 130030 }, { "父島", 130040 },

		{ "横浜", 140010 }, { "小田原", 140020 },

		{ "新潟", 150010 }, { "長岡", 150020 }, { "高田", 150030 }, { "相川", 150040 },

		{ "富山", 160010 }, { "伏木", 160020 },

		{ "金沢", 170010 }, { "輪島", 170020 },

		{ "福井", 180010 }, { "敦賀", 180020 },

		{ "甲府", 190010 }, { "河口湖", 190020 },

		{ "長野", 200010 }, { "松本", 200020 }, { "飯田", 200030 },

		{ "岐阜", 210010 }, { "高山", 210020 },

		{ "静岡", 220010 }, { "網代", 220020 }, { "三島", 220030 }, { "浜松", 220040 },

		{ "名古屋", 230010 }, { "豊橋", 230020 },

		{ "津", 240010 }, { "尾鷲", 240020 },

		{ "大津", 250010 }, { "彦根", 250020 },

		{ "京都", 260010 }, { "舞鶴", 260020 },

		{ "大阪", 270000 },

		{ "神戸", 280010 }, { "豊岡", 280020 },

		{ "奈良", 290010 }, { "風屋", 290020 },

		{ "和歌山", 300010 }, { "潮岬", 300020 },

		{ "鳥取", 310010 }, { "米子", 310020 },

		{ "松江", 320010 }, { "浜田", 320020 }, { "西郷", 320030 },

		{ "岡山", 330010 }, { "津山", 330020 },

		{ "広島", 340010 }, { "庄原", 340020 },

		{ "下関", 350010 }, { "山口", 350020 }, { "柳井", 350030 }, { "萩", 350040 },

		{ "徳島", 360010 }, { "日和佐", 360020 },

		{ "高松", 370000 },

		{ "松山", 380010 }, { "新居浜", 380020 }, { "宇和島", 380030 },

		{ "高知", 390010 }, { "室戸岬", 390020 }, { "清水", 390030 },

		{ "福岡", 400010 }, { "八幡", 400020 }, { "飯塚", 400030 }, { "久留米", 400040 },

		{ "佐賀", 410010 }, { "伊万里", 410020 },

		{ "長崎", 420010 }, { "佐世保", 420020 }, { "厳原", 420030 }, { "福江", 420040 },

		{ "熊本", 430010 }, { "阿蘇乙姫", 430020 }, { "牛深", 430030 }, { "人吉", 430040 },

		{ "大分", 440010 }, { "中津", 440020 }, { "日田", 440030 }, { "佐伯", 440040 },

		{ "宮崎", 450010 }, { "延岡", 450020 }, { "都城", 450030 }, { "高千穂", 450040 },

		{ "鹿児島", 460010 }, { "鹿屋", 460020 }, { "種子島", 460030 }, { "名瀬", 460040 },

		{ "那覇", 471010 }, { "名護", 471020 }, { "久米島", 471030 }, { "南大東", 472000 }, { "宮古島", 473000 }, { "石垣島", 474010 }, { "与那国島", 474020 },
	};
}